import { ResultQueryDataType } from "@/shared/types/task-type";

export const clueData = {
  clue: "Фильтрация по локации в таблице `battles` с использованием точного значения",
};

export const expectedResultData: ResultQueryDataType = {
  "columns": [
      "id",
      "full_name",
      "birth_year",
      "gender",
      "rank",
      "branch",
      "enlistment_city",
      "status",
      "enlistment_date"
  ],
  "data": [
      [
          1,
          "Иванов Алексей Петрович",
          1923,
          "male",
          "рядовой",
          "пехота",
          "Москва",
          "alive",
          "1941-08-01"
      ],
      [
          2,
          "Смирнова Анна Васильевна",
          1925,
          "female",
          "медсестра",
          "медицинская служба",
          "Ленинград",
          "wounded",
          "1942-01-15"
      ],
      [
          3,
          "Петров Дмитрий Иванович",
          1918,
          "male",
          "сержант",
          "артиллерия",
          "Сталинград",
          "killed",
          "1941-10-10"
      ],
      [
          4,
          "Козлов Николай Семёнович",
          1920,
          "male",
          "лейтенант",
          "танковые войска",
          "Харьков",
          "killed",
          "1941-09-10"
      ],
      [
          5,
          "Фёдорова Мария Ивановна",
          1922,
          "female",
          "санитар",
          "медицинская служба",
          "Киев",
          "missing",
          "1943-08-20"
      ],
      [
          6,
          "Жуков Андрей Григорьевич",
          1915,
          "male",
          "капитан",
          "авиация",
          "Минск",
          "alive",
          "1941-06-22"
      ],
      [
          7,
          "Павлов Яков Фёдорович",
          1917,
          "male",
          "сержант",
          "пехота",
          "Волгоград",
          "alive",
          "1942-09-01"
      ],
      [
          8,
          "Зайцева Людмила Михайловна",
          1924,
          "female",
          "снайпер",
          "пехота",
          "Ленинград",
          "wounded",
          "1943-01-15"
      ],
      [
          9,
          "Громов Михаил Сергеевич",
          1919,
          "male",
          "старшина",
          "инженерные войска",
          "Свердловск",
          "alive",
          "1942-03-12"
      ],
      [
          10,
          "Орлова Вера Павловна",
          1921,
          "female",
          "радист",
          "связисты",
          "Одесса",
          "wounded",
          "1943-07-01"
      ],
    ],
  "row_count": 10,
};
