export const profileAchievementsData = [
  {
    name: "Первая кровь",
    slug: "1-1",
    category: "Боевые достижения",
    historicalInfo: "Первый шаг к победе - самый важный. Так начинался путь многих героев ВОВ",
    description: "Решить первую задачу любого уровня",
    isAchieved: true,
  },
  {
    name: "Стратег-новичок",
    slug: "1-2",
    category: "Боевые достижения",
    historicalInfo: "В 1941 году советские солдаты учились воевать в тяжелейших условиях. Ты на верном пути!",
    description: "Решить 10 легких задач",
    isAchieved: false,
  },
  {
    name: "Защитник Сталинграда",
    slug: "2-1",
    category: "Исторические подвиги",
    historicalInfo: "200 дней мужества. Вы защитили город, как это делали герои 1943 года!",
    description: "Решить все задачи, связанные со Сталинградской битвой",
    isAchieved: true,
  },
];
