export const data = [
  {
    name: "Иванов Иван Иванович ББСО-01-22",
    score: 23233,
  },
  {
    name: "Хомутов Даниил Иванович БСБО-08-23",
    score: 23200,
  },
  {
    name: "Иванов Иван Иванович ББСО-01-22",
    score: 23233,
  },
  {
    name: "Иванов Иван Иванович ББСО-01-22",
    score: 23233,
  },
  {
    name: "Иванов Иван Иванович ББСО-01-22",
    score: 23233,
  },
  {
    name: "Хомутов Даниил Иванович БСБО-08-23",
    score: 23200,
  },
  {
    name: "Иванов Иван Иванович ББСО-01-22",
    score: 23233,
  },
  {
    name: "Иванов Иван Иванович ББСО-01-22",
    score: 23233,
  },
  {
    name: "Иванов Иван Иванович ББСО-01-22",
    score: 23233,
  },
  {
    name: "Хомутов Даниил Иванович БСБО-08-23",
    score: 23200,
  },
];
